# pandas
* filtering
* sorting
* useful methods
* groupby
* merge

In [11]:
import pandas as pd
import random

# Generate random student data
data = {
    'roll no': [random.randint(1000, 9999) for _ in range(10)],
    'name': ['Student{}'.format(i) for i in range(1, 11)],
    'subject': ['Math', 'Science', 'History', 'Geography', 'English'] * 2,
    # You can add more columns as needed
}

# Create DataFrame
students_df = pd.DataFrame(data)

# Display DataFrame
print(students_df)

   roll no       name    subject
0     7174   Student1       Math
1     1463   Student2    Science
2     2400   Student3    History
3     8468   Student4  Geography
4     7581   Student5    English
5     6326   Student6       Math
6     5313   Student7    Science
7     4349   Student8    History
8     9788   Student9  Geography
9     3308  Student10    English

In [3]:

students_df.subject.value_counts()

subject
Math         2
Science      2
History      2
Geography    2
English      2
Name: count, dtype: int64

In [4]:

students_df.subject.value_counts(dropna=False , normalize=True)*100

subject
Math         20.0
Science      20.0
History      20.0
Geography    20.0
English      20.0
Name: proportion, dtype: float64

In [1]:
import pandas as pd
import numpy as np
from datetime import datetime, timedelta

# Generate random fee transactions data for 1000 transactions
start_date = datetime(2024, 1, 1)
end_date = datetime(2024, 12, 31)
date_range = [start_date + timedelta(days=x) for x in range((end_date - start_date).days)]
dates = np.random.choice(date_range, size=1000)
fees = np.random.randint(1, 5000, size=1000)

# Create DataFrame
fee_transactions_df = pd.DataFrame({'date': dates, 'fee': fees})

# Display DataFrame
print(fee_transactions_df)

          date   fee
0   2024-06-28  2260
1   2024-08-08   141
2   2024-06-03  1474
3   2024-08-24  1739
4   2024-07-24  1928
..         ...   ...
995 2024-12-12  4238
996 2024-08-14  1251
997 2024-08-25  1825
998 2024-07-03  4451
999 2024-04-10   474

[1000 rows x 2 columns]

In [2]:
pd.cut(fee_transactions_df.fee, 
       [1,500,1000,3000,4000,5000])

0      (1000, 3000]
1          (1, 500]
2      (1000, 3000]
3      (1000, 3000]
4      (1000, 3000]
           ...
995    (4000, 5000]
996    (1000, 3000]
997    (1000, 3000]
998    (4000, 5000]
999        (1, 500]
Name: fee, Length: 1000, dtype: category
Categories (5, interval[int64, right]): [(1, 500] < (500, 1000] < (1000, 3000] < (3000, 4000] < (4000, 5000]]

In [3]:
pd.cut(fee_transactions_df.fee, 
       [1,500,1000,3000,4000,5000]).value_counts()

fee
(1000, 3000]    401
(4000, 5000]    194
(3000, 4000]    193
(1, 500]        106
(500, 1000]     106
Name: count, dtype: int64

In [4]:
pd.cut(fee_transactions_df.fee, 
       [1,500,1000,3000,4000,5000]).value_counts(normalize=True)*100

fee
(1000, 3000]    40.1
(4000, 5000]    19.4
(3000, 4000]    19.3
(1, 500]        10.6
(500, 1000]     10.6
Name: proportion, dtype: float64

In [5]:
pd.qcut(fee_transactions_df.fee, [0.3,.5,.7,.9,1])

0      (1450.8990000000001, 2476.0]
1                               NaN
2      (1450.8990000000001, 2476.0]
3      (1450.8990000000001, 2476.0]
4      (1450.8990000000001, 2476.0]
                   ...
995                (3479.6, 4530.2]
996                             NaN
997    (1450.8990000000001, 2476.0]
998                (3479.6, 4530.2]
999                             NaN
Name: fee, Length: 1000, dtype: category
Categories (4, interval[float64, right]): [(1450.8990000000001, 2476.0] < (2476.0, 3479.6] < (3479.6, 4530.2] < (4530.2, 4996.0]]

In [7]:
pd.qcut(fee_transactions_df.fee, [0,0.3,.5,.7,.9,1]).value_counts()

fee
(3.999, 1450.9]     300
(1450.9, 2476.0]    200
(2476.0, 3479.6]    200
(3479.6, 4530.2]    200
(4530.2, 4996.0]    100
Name: count, dtype: int64

In [8]:
pd.qcut(fee_transactions_df.fee, [0,0.3,.5,.7,.9,1]).value_counts(normalize=True)*100

fee
(3.999, 1450.9]     30.0
(1450.9, 2476.0]    20.0
(2476.0, 3479.6]    20.0
(3479.6, 4530.2]    20.0
(4530.2, 4996.0]    10.0
Name: proportion, dtype: float64

In [12]:
students_df.head()

   roll no      name    subject
0     7174  Student1       Math
1     1463  Student2    Science
2     2400  Student3    History
3     8468  Student4  Geography
4     7581  Student5    English

# filter on columns 
* & , | , ~
syntax:
'''
dataframe[(data.frame.column1=='value1') & (dataframe.column2=='value2') ]
'''

* string columns
* numeric columns
* datatime columns

In [14]:
students_df.head(10)

   roll no       name    subject
0     7174   Student1       Math
1     1463   Student2    Science
2     2400   Student3    History
3     8468   Student4  Geography
4     7581   Student5    English
5     6326   Student6       Math
6     5313   Student7    Science
7     4349   Student8    History
8     9788   Student9  Geography
9     3308  Student10    English

In [16]:
students_df['subject']=='Math'

0     True
1    False
2    False
3    False
4    False
5     True
6    False
7    False
8    False
9    False
Name: subject, dtype: bool

In [18]:
students_df[students_df['subject']=='Math']

   roll no      name subject
0     7174  Student1    Math
5     6326  Student6    Math